# COMMUNITIES = ["smartboursegroup"]
COMMUNITIES = {
    "1727038436": {
        "name": "بورسگرام | Boursegram",
        "name_id": "smartboursegroup",
        "type":"public_supergroup",
        "topics": {
            "40231": {"name": "غذایی"},
            "40209": {"name": "حمل و نقل"},
            "40783": {"name": "روند و‌ پیش بینی بازار_شاخص کل و شاخص هموزن"},
            "40211": {"name": "بانکها"},
            "40302": {"name": "خودرو و ساخت قطعات"},
            "48994": {"name": "آپشن (اختیار معامله)"},
            "40212": {"name": "سرمایه گذاریها_چند رشته اي صنعتي"},
            "40230": {"name": "دارویی"},
            "40246": {"name": "فلزات_ استخراج کانه های فلزی_زغال سنگ_سایرمعادن"},
            "40203": {"name": "انبوه سازي_ساختمانی"},
            "40232": {"name": "نیروگاهها (عرضه برق، گاز، بخاروآب گرم)"},
            "40248": {"name": "پالایشی (فراورده هاي نفتي)_استخراج نفت گاز"},
            "40253": {"name": "زراعت"},
            "40236": {"name": "قند و شكر"},
            "40778": {"name": "بورس کالا_دلار، سکه، طلا_عرضه اولیه"},
            "40208": {"name": "برقی-مخابرات_ساخت دستگاه‌ها و وسايل ارتباطي"},
            "40206": {
                "name": "فراکاب(کالا، فرابورس، انرژی3،..)_فعاليتهاي كمكي به نهادهاي مالي واسط"
            },
            "40207": {"name": "بیمه"},
            "40227": {"name": "محصولات شيميايي"},
            "40219": {"name": "سیمان"},
            "40210": {"name": "لیزینگ"},
            "40200": {"name": "خدمات فني و مهندسي_پیمانکاری صنعتی_فعاليت مهندسي"},
            "40247": {"name": "لاستيك و پلاستيك"},
            "40221": {"name": "خرده فروشی_تجارت عمده فروشی"},
            "40218": {"name": "ساير محصولات كاني غيرفلزي_کاشی و سرامیک"},
            "40217": {"name": "هتل و رستوران"},
            "40242": {"name": "ماشين آلات و تجهيزات_ساخت محصولات فلزي"},
            "40249": {
                "name": "محصولات كاغذي_چاپ_محصولات چوبي_چرم_منسوجات_ فعالیتهای هنری"
            },
            "40202": {"name": "رایانه_اطلاعات و ارتباطات_توليد محصولات كامپيوتري"},
        },
    }
}

SUBGROUPS = {
    "1727038436": {
        "name": "بورسگرام | Boursegram",
        "40231": {"name": "غذایی"},
        "40209": {"name": "حمل و نقل"},
        "40783": {"name": "روند و‌ پیش بینی بازار_شاخص کل و شاخص هموزن"},
        "40211": {"name": "بانکها"},
        "40302": {"name": "خودرو و ساخت قطعات"},
        "48994": {"name": "آپشن (اختیار معامله)"},
        "40212": {"name": "سرمایه گذاریها_چند رشته اي صنعتي"},
        "40230": {"name": "دارویی"},
        "40246": {"name": "فلزات_ استخراج کانه های فلزی_زغال سنگ_سایرمعادن"},
        "40203": {"name": "انبوه سازي_ساختمانی"},
        "40232": {"name": "نیروگاهها (عرضه برق، گاز، بخاروآب گرم)"},
        "40248": {"name": "پالایشی (فراورده هاي نفتي)_استخراج نفت گاز"},
        "40253": {"name": "زراعت"},
        "40236": {"name": "قند و شكر"},
        "40778": {"name": "بورس کالا_دلار، سکه، طلا_عرضه اولیه"},
        "40208": {"name": "برقی-مخابرات_ساخت دستگاه‌ها و وسايل ارتباطي"},
        "40206": {
            "name": "فراکاب(کالا، فرابورس، انرژی3،..)_فعاليتهاي كمكي به نهادهاي مالي واسط"
        },
        "40207": {"name": "بیمه"},
        "40227": {"name": "محصولات شيميايي"},
        "40219": {"name": "سیمان"},
        "40210": {"name": "لیزینگ"},
        "40200": {"name": "خدمات فني و مهندسي_پیمانکاری صنعتی_فعاليت مهندسي"},
        "40247": {"name": "لاستيك و پلاستيك"},
        "40221": {"name": "خرده فروشی_تجارت عمده فروشی"},
        "40218": {"name": "ساير محصولات كاني غيرفلزي_کاشی و سرامیک"},
        "40217": {"name": "هتل و رستوران"},
        "40242": {"name": "ماشين آلات و تجهيزات_ساخت محصولات فلزي"},
        "40249": {"name": "محصولات كاغذي_چاپ_محصولات چوبي_چرم_منسوجات_ فعالیتهای هنری"},
        "40202": {"name": "رایانه_اطلاعات و ارتباطات_توليد محصولات كامپيوتري"},
    }
}